Revit 2024 API
RebarShapeConstraint180DegreeBendRadius Properties
The RebarShapeConstraint180DegreeBendRadius type exposes the following members.
Properties
Name | Description
ArcReferenceType
 A choice of rule for measuring the radius.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
See Also
RebarShapeConstraint180DegreeBendRadius Class
Autodesk.Revit.DB.Structure Namespace